InformationRegisters/ХранилищеФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеФайлов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеДвоичныхДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПутьФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Comment>Хранение ссылки на объект Не позволит штатными средствами удалить объект без очистки всех прикреплений</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецПрисоединенныхФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХраненияФайлов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МестоХраненияПрикрепленныхФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасширениеИмениФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеФайла</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеФайлов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/МестоХраненияПрикрепленныхФайлов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МестоХраненияПрикрепленныхФайлов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийДисковыйРесурс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ХранилищеФайлов/Forms/УпрФормаСписка/Ext/Form/Module.bsl
// © Primus1C  25.06.2023  НАЧАЛО ►

#Область ДействияФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список.Параметры.УстановитьЗначениеПараметра("ОбъектУИД", Параметры.ОбъектУИД);
	Если Параметры.Свойство("ВладелецСсылка") Тогда
		ВладелецСсылка = Параметры.ВладелецСсылка;               
		Если ТипЗнч(ВладелецСсылка) = Тип("ДокументСсылка.ИнвойсЗакупки") Тогда 
			ВладелецПредставление = СтрШаблон(НСтр("ru = 'Инвойс закупки %1 от %2'; en = 'Purchase invoice %1 от %2'"), 
												ВладелецСсылка.НомерИнвойсаПоставщика, 
												Формат(ВладелецСсылка.ДатаИнвойсаПоставщика, "ДФ=dd.MM.yyyy"));
		Иначе
			ВладелецПредставление = Строка(ВладелецСсылка);
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("НазначениеФайла") Тогда
		Если ЗначениеЗаполнено(Параметры.НазначениеФайла) Тогда
			Список.ТекстЗапроса = Список.ТекстЗапроса + " И РСХранФайлов.НазначениеФайла = &НазначениеФайла";
			Список.Параметры.УстановитьЗначениеПараметра("НазначениеФайла", Параметры.НазначениеФайла);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)    
	
	//Заголовок = "Прикрепленные файлы: " + ЭтотОбъект.ВладелецФормы.Объект.Ссылка; 
	Заголовок = НСтр("ru = 'Прикрепленные файлы: '; en = 'Attached files: '") + ВладелецПредставление;
	НачатьПодключениеРасширенияРаботыСФайлами(Новый ОписаниеОповещения("РасширениеПоключено", ЭтаФорма));
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	л_ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаВыбораФайла", ЭтаФорма);
	//открыть диалог выбора файла. Если пользователь работает из ВебКлиента, то открывается соединение с типом "WebServerExtension"
	НачатьПомещениеФайла(л_ОписаниеОповещения,,, Истина, ЭтотОбъект.УникальныйИдентификатор); 
	
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПолучитьНастройкиХраненияФайлов()
//	Возврат РегистрыСведений.НастройкаХраненияФайлов.ПолучитьПоследнее();
//КонецФункции // ПолучитьНастройкиХраненияФайлов()

//&НаКлиенте
//Функция ПолучитьРасширение(ИмяФайла)

//	л_МассивЧастейИмени = ОбщегоНазначения.СтрРазделить(ИмяФайла,".");

//	Возврат "." + л_МассивЧастейИмени[л_МассивЧастейИмени.ВГраница()];
//	
//КонецФункции // ПолучитьРасширение()

//&НаКлиенте
//Функция ПолучитьИмяБезРасширения(ИмяФайла)
//	
//	л_ИмяБезРасширения = "";
//	
//	л_МассивЧастейИмени = ОбщегоНазначения.СтрРазделить(ИмяФайла, ".");
//	Для л_Сч = 0 По л_МассивЧастейИмени.ВГраница() - 1 Цикл //цикл по всем частям кроме последней, где расширение имени
//		л_ЧастьИмени		= л_МассивЧастейИмени[л_Сч];
//		л_ИмяБезРасширения	= л_ИмяБезРасширения + "." + л_ЧастьИмени;
//	КонецЦикла;
//	
//	Возврат Прав(л_ИмяБезРасширения, СтрДлина(л_ИмяБезРасширения) - 1); //удалить первую точку в имени
//	
//КонецФункции // ПолучитьРасширение()

&НаКлиенте
Процедура ОбработкаВыбораФайла(ЕстьВыборПользователя, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт 
	
	Если ЕстьВыборПользователя = Ложь Тогда
        Возврат;
    КонецЕсли;
	
	//Сообщить("Тип клиента: "+ПолучитьТипКлиента());

	//Если ПолучитьТипКлиента() = "WebServerExtension" Тогда
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		//в параметре "ВыбранноеИмяФайла" строка имени файла без полного пути, например: name.ext
		л_ОписаниеФайла = Новый Структура();
		л_ОписаниеФайла.Вставить("Имя", 				ВыбранноеИмяФайла);
		л_ОписаниеФайла.Вставить("ИмяБезРасширения", 	ОбщегоНазначения.ПолучитьИмяБезРасширения(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("ПолноеИмя", 			"");
		л_ОписаниеФайла.Вставить("Путь", 				"");
		л_ОписаниеФайла.Вставить("Расширение", 			ОбщегоНазначения.ПолучитьРасширение(ВыбранноеИмяФайла));
		л_ОписаниеФайла.Вставить("Размер", 				ПолучитьИзВременногоХранилища(Адрес).Размер());
		л_ОписаниеФайла.Вставить("Назначение", 			ДопПараметры);
		//л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);

		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи	= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор");
	
		//ДобавитьВложенныйФайл(Адрес, ВладелецФормы.Объект.Ссылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		ДобавитьВложенныйФайл(Адрес, ВладелецСсылка, л_ОписаниеФайла, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
		Если НЕ л_Отказ Тогда 
			ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
			Оповестить("ОбновитьСтрокуПрикреплений", л_ОписаниеФайла.Имя, ЭтаФорма);
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(л_Сообщение) Тогда
			//Сообщить(л_Сообщение); 
			клОшибка(л_Сообщение);
		КонецЕсли;
		
	Иначе 		
		
		л_Файл = Новый Файл(ВыбранноеИмяФайла);
		л_ОписаниеФайла = Новый Структура("Имя,ИмяБезРасширения,ПолноеИмя,Путь,Расширение");
		ЗаполнитьЗначенияСвойств(л_ОписаниеФайла, л_Файл);
		л_ОписаниеФайла.Вставить("Размер",					0);
		л_ОписаниеФайла.Вставить("Файл",					л_Файл);
		л_ОписаниеФайла.Вставить("АдресВременногоХранилища",Адрес);
		
		л_Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ПослеПроверкиСуществованияФайла", ЭтаФорма, л_ОписаниеФайла));
		
	КонецЕсли;
	
КонецПроцедуры // ПослеПомещенияФайлаВоВременноеХранилище()

&НаКлиенте
Процедура ПослеПроверкиСуществованияФайла(ФайлСуществует, ПараметрыФайла) Экспорт 
	
	Если ФайлСуществует Тогда 
		ПараметрыФайла.Файл.НачатьПолучениеРазмера(Новый ОписаниеОповещения("ПослеПолученияРазмераФайла", ЭтаФорма, ПараметрыФайла));
	Иначе 
		//Сообщить("Папка " + ПараметрыФайла.Путь + " не существует!"); 
		клОшибка(СтрШаблон( НСтр("ru = 'Папка %1 не существует!'; en = 'Folder %1 does not exist!'"), ПараметрыФайла.Путь)); 
	КонецЕсли;  
	
КонецПроцедуры // ПослеПроверкиСуществованияФайла()

&НаКлиенте
Процедура ПослеПолученияРазмераФайла(Результат, Параметр) Экспорт
	
	Параметр.Размер=Результат;
	
	//удалить свойство структуры "Файл" т.к. оно вызывает ошибку преобразования данных XDTO: Отсутствует отображение для типа 'Файл'
	Параметр.Удалить("Файл");
	
	л_Отказ		= Ложь;
	л_Сообщение	= "";
	л_КлючЗаписи= Новый Структура("ОбъектУИД,ОбъектСсылка,МестоХраненияФайлов,ИмяФайла,РасширениеИмениФайла,Автор,НазначениеФайла");
	
	//ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, ВладелецФормы.Объект.Ссылка, Параметр,л_Отказ,,л_КлючЗаписи,л_Сообщение);
	ДобавитьВложенныйФайл(Параметр.АдресВременногоХранилища, ВладелецСсылка, Параметр, л_Отказ, , л_КлючЗаписи, л_Сообщение);
		
	Если НЕ л_Отказ Тогда 
		ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Добавление);
		Оповестить("ОбновитьСтрокуПрикреплений", Параметр.Имя, ЭтаФорма);
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(л_Сообщение) Тогда
		//Сообщить(л_Сообщение); 
		клОшибка(л_Сообщение);
	КонецЕсли;   
	
КонецПроцедуры // ПолучитьРазмерФайла()


&НаСервере
Процедура ДобавитьВложенныйФайл(знач п_АдресВременногоХранилища, знач п_Объект, знач п_Файл, п_Отказ, п_ИзменитьСуществующуюЗапись=Ложь, п_КлючЗаписи="", ТекстСообщения="")
	
	Если НЕ ЗначениеЗаполнено(п_Объект) Тогда 
		п_Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Сначала сохраните новый объект'; en = 'First save the new object'");
		Возврат;
	КонецЕсли;
	л_Дата = ТекущаяДата();	
	//л_НастройкаХраненияФайлов = РегистрыСведений.НастройкаХраненияФайлов.ПолучитьПоследнее(л_Дата);
	л_НастройкаХраненияФайлов = ОбщегоНазначенияПовтИсп.НастройкаХраненияФайлов();
	НачатьТранзакцию();
	Если л_НастройкаХраненияФайлов.МестоХраненияФайлов = Перечисления.МестоХраненияПрикрепленныхФайлов.ОбщийДисковыйРесурс Тогда 
		Если п_Файл.Размер > л_НастройкаХраненияФайлов.МаксРазмерФайлаДляИБ Тогда 
			п_Отказ = Истина;                     
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Размер файла: %1 байт превышает максимальный размер, установленный в настройках (%2 байт)'; en = 'File size: %1 byte exceeds the maximum size set in the settings (%2 bytes)'"), 
										Формат(п_Файл.Размер, "ЧРГ="), Формат(л_НастройкаХраненияФайлов.МаксРазмерФайлаДляИБ, "ЧРГ="));
			//"Размер файла: " + Формат(п_Файл.Размер, "ЧРГ=") + " байт превышает максимальный размер установленный в настройках (" + л_НастройкаХраненияФайлов.МаксРазмерФайлаДляИБ + " байт)";
			УдалитьИзВременногоХранилища(п_АдресВременногоХранилища);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
		РегистрыСведений.ХранилищеФайлов.СохранитьФайлНаДиск(п_АдресВременногоХранилища, л_НастройкаХраненияФайлов, п_Объект, п_Файл, п_Отказ, ТекстСообщения);
		Если п_Отказ Тогда 
			УдалитьИзВременногоХранилища(п_АдресВременногоХранилища);
			ЗафиксироватьТранзакцию();
			Возврат;
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ п_Отказ Тогда
		л_Запись = РегистрыСведений.ХранилищеФайлов.СоздатьМенеджерЗаписи();
		Если ТипЗнч(п_КлючЗаписи) = Тип("Структура") И п_КлючЗаписи.Свойство("ОбъектСсылка") И ЗначениеЗаполнено(п_КлючЗаписи.ОбъектСсылка) Тогда
			ЗаполнитьЗначенияСвойств(л_Запись,п_КлючЗаписи);
			л_Запись.Прочитать();
		КонецЕсли;
		РегистрыСведений.ХранилищеФайлов.ДобавитьЗаписьВРегистр(л_Дата, п_Объект, п_Файл, л_НастройкаХраненияФайлов, п_Отказ, п_ИзменитьСуществующуюЗапись, л_Запись, ТекстСообщения);
		Если п_Отказ Тогда 
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		п_КлючЗаписи=РегистрыСведений.ХранилищеФайлов.ПолучитьКлючЗаписи(п_Объект,п_Файл,л_НастройкаХраненияФайлов);
	КонецЕсли;
	УдалитьИзВременногоХранилища(п_АдресВременногоХранилища);
	ЗафиксироватьТранзакцию();  
	
КонецПроцедуры


&НаКлиенте
Процедура УдалитьВложенныйФайл(Команда)  
	
	Если НЕ ДоступноУдаление() Тогда 
		клПредупреждение(НСтр("ru = 'Вам недоступно удаление'; en = 'You are not allowed to delete'"));
		Возврат;
	КонецЕсли;    
	
	л_КлючЗаписи = ЭтаФорма.Элементы.Список.ТекущаяСтрока;
	Если л_КлючЗаписи <> Неопределено Тогда 
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеОтветаНаВопрос", ЭтаФорма),
			//"Уверены, что хотите удалить файл " + ЭтаФорма.Элементы.Список.ТекущиеДанные.ИмяФайла + "." + ЭтаФорма.Элементы.Список.ТекущиеДанные.РасширениеИмениФайла+" ?",
			СтрШаблон(НСтр("ru = 'Уверены, что хотите удалить файл %1.%2 ?'; en = 'Are you sure you want to delete the file %1.%2 ?'"), ЭтаФорма.Элементы.Список.ТекущиеДанные.ИмяФайла, ЭтаФорма.Элементы.Список.ТекущиеДанные.РасширениеИмениФайла),  
			РежимДиалогаВопрос.ДаНет, 15, КодВозвратаДиалога.Нет, НСтр("ru = 'Удаление прикрепленного файла'; en = 'Delete an attached file'"));
	КонецЕсли; 
	
КонецПроцедуры // УдалитьВложенныйФайл()

&НаСервереБезКонтекста
Функция ДоступноУдаление()  
	
	Возврат Истина;
	
	Возврат РольДоступна("УдалениеПрикрепленныхФайлов"); 
	
КонецФункции // ДоступноУдаление()


&НаКлиенте
Процедура ПослеОтветаНаВопрос(ВыборПользователя, ДополнительныеПараметры) Экспорт
	
	Если ВыборПользователя = КодВозвратаДиалога.Да Тогда 
		л_Отказ			= Ложь;
		л_Сообщение		= "";
		л_КлючЗаписи 	= ЭтаФорма.Элементы.Список.ТекущаяСтрока;
		Если л_КлючЗаписи <> Неопределено Тогда 
			УдалитьФайл(л_КлючЗаписи, л_Отказ, л_Сообщение);
			Если л_Отказ Тогда 
				//Сообщить(л_Сообщение);
				клОшибка(л_Сообщение);
			Иначе 
				ЭтаФорма.ОтобразитьИзменениеДанных(л_КлючЗаписи, ВидИзмененияДанных.Удаление);
				Оповестить("ОбновитьСтрокуПрикреплений",,ЭтаФорма);
			КонецЕсли;
		Иначе 
			клПредупреждение(НСтр("ru = 'Выберите файл для удаления'; en = 'Select file to delete'"));
		КонецЕсли;
	КонецЕсли;  
	
КонецПроцедуры // ПослеОтветаНаВопрос()

&НаСервереБезКонтекста
Процедура УдалитьФайл(Знач КлючЗаписи, Отказ, Сообщение)  
	
	НачатьТранзакцию();
	РегистрыСведений.ХранилищеФайлов.УдалитьФайлСДиска(КлючЗаписи, Отказ, Сообщение);
	Если Отказ Тогда 
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	РегистрыСведений.ХранилищеФайлов.УдалитьЗаписьИзРегистра(КлючЗаписи, Отказ, Сообщение);
	Если Отказ Тогда 
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	ЗафиксироватьТранзакцию(); 
	
КонецПроцедуры // УдалитьВложенныйФайл()

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;
	ЗапуститьОткрытиеФайла(); 
	
КонецПроцедуры

Процедура ПослеОткрытияФайла(Параметр1,Параметр2)Экспорт 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИмяФайла(Знач КлючЗаписи) 
	
	л_ИмяФайла = Новый Структура();
	
	л_Запись = РегистрыСведений.ХранилищеФайлов.ПолучитьЗапись(КлючЗаписи);
	л_ИмяФайла.Вставить("ИмяФайла", 			л_Запись.ИмяФайла);
	л_ИмяФайла.Вставить("РасширениеИмениФайла", л_Запись.РасширениеИмениФайла);
	л_ИмяФайла.Вставить("ПутьФайла",			л_Запись.ПутьФайла);
	
	Возврат л_ИмяФайла;  
	
КонецФункции // ПолучитьИмяФайла()

&НаСервереБезКонтекста
Функция ПолучитьАдресВХранилище(КлючЗаписи)

	Возврат РегистрыСведений.ХранилищеФайлов.ПолучитьАдресФайлаВоВременномХранилище(КлючЗаписи);

КонецФункции // ПолучитьАдресВХранилище()

&НаКлиенте
Процедура ЗапуститьОткрытиеФайла()   
	
	л_КлючЗаписи = ЭтаФорма.Элементы.Список.ТекущаяСтрока;
	Если л_КлючЗаписи = Неопределено Тогда 
		клПредупреждение(НСтр("ru = 'Выберите файл для просмотра!'; en = 'Select a file to view!'"));
		Возврат;
	КонецЕсли;
	
	л_ИмяФайла = ПолучитьИмяФайла(л_КлючЗаписи);
	л_Параметр = Новый Структура();
	л_Параметр.Вставить("ИмяФайла", л_ИмяФайла);
	л_Параметр.Вставить("КлючЗаписи", л_КлючЗаписи);
	
	НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ПослеПолученияКаталогаВременныхФайлов", ЭтаФорма, л_Параметр));
	
КонецПроцедуры // ЗапуститьОткрытиеФайла()

&НаКлиенте
Процедура ПослеПолученияКаталогаВременныхФайлов(ИмяКаталога, Параметр) Экспорт 
	
	л_ИмяВременногоФайла = ИмяКаталога + Параметр.ИмяФайла.ИмяФайла + Параметр.ИмяФайла.РасширениеИмениФайла;
	
	//Сообщить("Тип клиента: "+ПолучитьТипКлиента());
	
	//Если ПолучитьТипКлиента() = "WebServerExtension" Тогда
	Если ОбщегоНазначенияСервер.ПолучитьТипКлиента() = "WebServerExtension" Тогда
		л_ИмяВременногоФайла = "" + Параметр.ИмяФайла.ИмяФайла + Параметр.ИмяФайла.РасширениеИмениФайла;
	КонецЕсли;	
	
	л_АдресВремХран = ПолучитьАдресВХранилище(Параметр.КлючЗаписи);
	
	Если НЕ ПустаяСтрока(л_АдресВремХран) Тогда 
		ПолучитьФайл(л_АдресВремХран, л_ИмяВременногоФайла, Истина);
		//УдалитьИзВременногоХранилища(л_АдресВремХран);
	КонецЕсли;
	
КонецПроцедуры // ПослеПолученияКаталогаВременныхФайлов()


&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ЗапуститьОткрытиеФайла();
	
КонецПроцедуры


&НаКлиенте
Процедура РасширениеПоключено(ЕстьПодключение, Параметр)Экспорт 
	
	Если ЕстьПодключение Тогда 

	Иначе 
		НачатьУстановкуРасширенияРаботыСФайлами();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКак(Команда)
	
	л_КлючЗаписи = ЭтаФорма.Элементы.Список.ТекущаяСтрока;
	Если л_КлючЗаписи = Неопределено Тогда 
		клПредупреждение(НСтр("ru = 'Выберите файл для сохранения!'; en = 'Select a file to save!'"));
		Возврат;
	КонецЕсли;
	
	л_ИмяФайла=ПолучитьИмяФайла(л_КлючЗаписи);
	л_Параметр=Новый Структура();
	л_Параметр.Вставить("ИмяФайла",л_ИмяФайла);
	л_Параметр.Вставить("КлючЗаписи",л_КлючЗаписи);	
	
	АдресВременногоХранилища="";
	НачальноеИмяФайла=л_ИмяФайла.ПутьФайла+"\"+л_ИмяФайла.ИмяФайла+л_ИмяФайла.РасширениеИмениФайла;
	ВыбранноеИмяФайла="";
	Интерактивно=Ложь;
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеОкончанияПомещения",ЭтаФорма),АдресВременногоХранилища,НачальноеИмяФайла, Интерактивно, ЭтаФорма.УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияПомещения(ЕстьВыборПользователя, АдресВременногоХранилища, ВыбранноеИмяФайла, ДопонительныеПараметры)Экспорт 
	
	Если НЕ ЕстьВыборПользователя Тогда 
		Возврат;
	КонецЕсли;
	
	ПолучитьФайл(АдресВременногоХранилища, ВыбранноеИмяФайла,Истина);
	
КонецПроцедуры // ПослеОкончанияПомещения()

//&НаСервереБезКонтекста
//Функция ПолучитьТипКлиента()
//	
//	УстановитьПривилегированныйРежим(Истина);
//	
//	л_ИмяПриложения = "";
//	
//    л_Соединения = ПолучитьСоединенияИнформационнойБазы();
//	Для Каждого л_Соединение Из л_Соединения Цикл 
//		Если л_Соединение.НомерСоединения = НомерСоединенияИнформационнойБазы() Тогда 
//			л_ИмяПриложения = л_Соединение.ИмяПриложения;
//			Прервать;
//		КонецЕсли;
//	КонецЦикла;

//	УстановитьПривилегированныйРежим(Ложь);

//	Возврат л_ИмяПриложения;
//	
//КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент) 
	
	 //для вывода предварительного просмотра изображения
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
	ДанныеФайла = ПолучитьДанныеФайла(Элементы.Список.ТекущаяСтрока, УникальныйИдентификатор);
        Если ДанныеФайла.Расширение = ".jpg"
            ИЛИ ДанныеФайла.Расширение = ".jpeg"
            ИЛИ ДанныеФайла.Расширение = ".png"
            ИЛИ ДанныеФайла.Расширение = ".gif" Тогда
            СсылкаНаКартинку = ДанныеФайла.СсылкаНаДвоичныеДанныеФайла;        
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(Знач ПрисоединенныйФайл, Знач ИдентификаторФормы = Неопределено)
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ХранилищеФайловСрезПоследних.ХранилищеДвоичныхДанных,
	             |	ХранилищеФайловСрезПоследних.РасширениеИмениФайла
	             |ИЗ
	             |	РегистрСведений.ХранилищеФайлов.СрезПоследних КАК ХранилищеФайловСрезПоследних
	             |ГДЕ
	             |	ХранилищеФайловСрезПоследних.ОбъектУИД = &ОбъектУИД";  
	Запр.УстановитьПараметр("ОбъектУИД", ПрисоединенныйФайл.ОбъектУИД);
	Выборка = Запр.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда
		ХранилищеДвоичныхДанных = Выборка.ХранилищеДвоичныхДанных.Получить();	
		Расширение = Выборка.РасширениеИмениФайла ;
	Иначе
	   ХранилищеДвоичныхДанных = Неопределено;
	   Расширение = Неопределено;
	КонецЕсли;
	
	ДополнительнаяИнформация = Новый Структура;
	ДополнительнаяИнформация.Вставить("СсылкаНаДвоичныеДанныеФайла",  ХранилищеДвоичныхДанных);
	//ДополнительнаяИнформация.Вставить("ОтносительныйПуть",            ПолучитьИдентификаторОбъекта(ФайлОбъект.ВладелецФайла) + "\");
	//ДополнительнаяИнформация.Вставить("ДатаМодификацииУниверсальная", ФайлОбъект.ДатаМодификацииУниверсальная);
	//ДополнительнаяИнформация.Вставить("ИмяФайла",                     ФайлОбъект.Наименование + "." + ФайлОбъект.Расширение);
	//ДополнительнаяИнформация.Вставить("Наименование",                 ФайлОбъект.Наименование);
	ДополнительнаяИнформация.Вставить("Расширение",                   Расширение);
	//ДополнительнаяИнформация.Вставить("Размер",                       ФайлОбъект.Размер);
	
	Возврат ДополнительнаяИнформация;	

КонецФункции 


// © Primus1C  ОКОНЧАНИЕ ◄
